Revit 2024 API
Dimension.Prefix Property
The text shown before the segment's value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string Prefix { get; set; }
Visual Basic
Public Property Prefix As String
	Get
	Set
Visual C++
public:
property String^ Prefix {
	String^ get ();
	void set (String^ value);
}
Remarks
This property is for use with single-segmment dimensions only. For multi-segment dimensions use the corresponding properties of the DimensionSegment class.
See Also
Dimension Class
Autodesk.Revit.DB Namespace